[
  {
    "achievementTitle": "Token/Crypto Revoke Apps - web3ramen",
    "achievementDescription": "Similar to Revoke.cash / Debank, when we use a tokens, we need to revoke the allowance permission in our wallet. From the existing apps especially Revoke.cash, I could see some room of improvement can be made such as modernizing the UI/UX, revoke all permission use case, the date information of the permission given, and some other stuff. With the help of my fellow Crypto partner, we are trying to deliver this apps by end of this year and this could kickstart my journey into Blockchain space.",
    "achievementRole": "Full-Stack Developer",
    "achievementLink": "https://web3ramen.com/"
  },
  {
    "achievementTitle": "LocumStreet - Community Job-Search Web App (Ongoing)",
    "achievementDescription": "An initiative apps developed to help local healthcare professional (Doctor, Nurses, Dentist, Pharma) to find a freelance jobs as we could see they're using Facebook Group at the moment to find on-call job. This is an open-source & community driven apps to help local healthcare professional to find job.",
    "achievementRole": "Full-Stack Developer",
    "achievementLink": "https://github.com/paanjoe/LocumStreet-Front"
  },
  {
    "achievementTitle": "Catena-X Hackathon by BASF & Porsche Consulting",
    "achievementDescription": "Joined BASF Internal hackathon and a Winner by developing a MVP product for Quality Data Transfer to all automotive supplier for BASF and analyze revenue stream from the product developed.",
    "achievementRole": "Analyst & Front-End Developer",
    "achievementLink": "#"
  },
  {
    "achievementTitle": "DeveloperKaki Salary Survey Data Visualization 2021 & 2022",
    "achievementDescription": "Take initiative to develop and design software developer community in Malaysia (DeveloperKaki) for its data visualization using Google Data Studio. Main objective for this initiative is for balancing the scales of being underpaid or overpaid requires huge deliberation. Oftentimes, leading to a heated discussions.",
    "achievementRole": "Data Visualization Developer",
    "achievementLink": "https://datastudio.google.com/u/0/reporting/79dbf003-8d9f-4e71-89b6-66ac6e177f29/page/MOTWC"
  },
  {
    "achievementTitle": "Mobile App Development Tutor - UUM (Non-Profit)",
    "achievementDescription": "As one of the initiative to give back to the society, I have been approached to be a Mobile App tutor to UUM Bachelor student. This class focuses on Hybrid and Native mobile app development using Ionic and Android Studio.",
    "achievementRole": "Presenter",
    "achievementLink": "#"
  },
  {
    "achievementTitle": "BagiFree WebApps - Giveaway your unused item!",
    "achievementDescription": "A hobby project to provide a platform for Malaysian to giveaway their unused item for free instead of throwing it away. Other people's trash might be other people's gem! This web apps was develop using Angular, TypeORM, PostgreSQL, and AWS.",
    "achievementRole": "Front-End Developer",
    "achievementLink": "#/"
  },
  {
    "achievementTitle": "Rentura Mobile Apps - All-in-one rental platform",
    "achievementDescription": "A failed startup project to bring a new rental business model using on-demand services. This apps allow everyone to rent all kind of items or services using one single apps. Although we received a good number of user registration, however due to Insurance business in Malaysia (that time) is still not ready to support this business model, most of the users reluctant to rent their item without deposits.",
    "achievementRole": "Back-End Developer/Analyst",
    "achievementLink": "https://wiser.my/rentura-sewa-pelbagai-jenis-barangan-dari-aplikasi-yang-dibangunkan-oleh-anak-tempatan"
  },
  {
    "achievementTitle": "CariDarah Mobile Apps - On-Demand blood donation",
    "achievementDescription": "Concerning on the rise of blood donation request by Medical Healthcare in Malaysia. One of the initiative that I've done is develop an on-demand blood donation apps that will help its user to find where to donate their blood or might want to request urgent blood request at nearby healthcare facilities.",
    "achievementRole": "Full-Stack Developer",
    "achievementLink": "#"
  },
  {
    "achievementTitle": "CyberLaw & CyberSecurity - UUM",
    "achievementDescription": "In collaboration with UUM and Lawyer from Securities Commission, I was invited to give a talk on Malaysia CyberSecurity landscape to UUM Student and what are the demanding skills for the student to equip before entering career field.",
    "achievementRole": "Presenter",
    "achievementLink": "#"
  },
  {
    "achievementTitle": "Champion - Asian English Olympic 2014 in Jakarta",
    "achievementDescription": "Went into Short Film competition that representative as Malaysia in Jakarta and won the contest as Champion on making the Short Film and 48 Hours short film reels.",
    "achievementRole": "Main Video Editor",
    "achievementLink": "https://www.youtube.com/watch?v=noLUEBVIEvg"
  }
]
