[
  {
    "workPostition": "Senior Specialist Digialization",
    "workType": "Permanent",
    "workTeam": "Legal, Tax, & Consolidation",
    "workCompany": "BASF Asia Pacific Sdn Bhd",
    "workCompanyLogo": "https://rsb.org/wp-content/uploads/2018/03/BASF-LOGO.jpg",
    "workDuration": "Mar 2022 - Present",
    "workDescription" : "In the Regulation & Tax product team, I need to give consultation and support BASF business partner in digitalize their product through various options (SaaS/SAP/Low-Code-No-Code). The role require for me to develop non-functional requirements, designing, enhance, and implementation to provide our internal & external business partner sustainable state-of-the-art solutions. As a Team Agility Master, I need to manage complex development environments using both internal and external resources and providing Solution Design to the stakeholder.",
    "workBullet": [
      {
        "bullet": "Ensures sustainable and stable solutions from a technical point of view together with operations."
      },
      {
        "bullet": "Contributes to planning and provides cost estimations for complex projects."
      },
      {
        "bullet": "Deliverable of customer-centric solutions."
      },
      {
        "bullet": "Technical design and implementation of application enhancements and new applications for BASF Regulation & Tax processes."
      }
    ],
    "workMethodologies": "Agile Methodologies (Main) | Waterfall (Conditional)",
    "workResponsibilities": "30% Technical & 70% Management - Team Agility Master for Corporate Legal Sub-Product",
    "workTechnology": ["SAP MDG, HANA, & BW Consultancy", "Microsoft low code / no code solutions", "Develop AI Models", "Develop and manage App Services (e.g. model-driven apps, process automation apps)", "Microsoft Azure", "AI Builder", "Power Platform services", "Microsoft Power BI", "SAP Technologies (HANA/Fiori)"]
  },
  {
    "workPostition": "Full-Stack Software Developer",
    "workType": "Contract",
    "workTeam": "Internet Hosting",
    "workCompany": "ExxonMobil Digital Hub",
    "workCompanyLogo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Exxon_Mobil_Logo.svg/2560px-Exxon_Mobil_Logo.svg.png",
    "workDuration": "Nov 2021 - Mar 2022",
    "workDescription" : "In ExxonMobil Internet Hosting team, my key responsibilities is to explore and develop potential software that can reduce man-hours, workload, and transforming traditional process into automation. As a developer, I have developed a couple of web applications to make a centralized configuration solution to ExxonMobil Global Business (PortMapping, HRP Network model, and more). At the same time, I was also responsible to explore and share on how to use, develop, and maintain Software Defined Perimeter (SDP) by AppGate.",
    "workBullet": [
      {
        "bullet": "Develop end-to-end web applications from planning, designing, implementation, and tests."
      },
      {
        "bullet": "Participate in Enterprise Architecture (EA) and Database design discussion."
      },
      {
        "bullet": "VPN migration from Cisco Global Protect to Software Defined Perimeter (SDP) by AppGate - Trustless VPN software."
      },
      {
        "bullet": "Participate in business discussion to identify on which area to improve, enhance, and explore."
      }
    ],
    "workMethodologies": "Agile Methodologies (Main) | Waterfall (Conditional)",
    "workResponsibilities": "70% Technical & 30% Management",
    "workTechnology": ["ReactJS", "Software Defined Perimeter (SDP)", "Server Configuration (Linux)", "Python (Flask/FastAPI)", "NodeJS", "GitHub Enterprise", "Microsoft Azure", "Azure DevOps", "Powershell Scripting", "Splunk", "Grafana"]
  },
  {
    "workPostition": "Senior System Analyst",
    "workType": "Contract",
    "workTeam": "Payment - Real-Time Payment Solution",
    "workCompany": "Employee Provident Fund (EPF) Malaysia",
    "workCompanyLogo": "https://seeklogo.com/images/K/kwsp-logo-71555A2390-seeklogo.com.png",
    "workDuration": "May 2020 - Oct 2021",
    "workDescription" : "EPF is aiming to transform its business into Digital landscape where it focuses on customer centricity and omni-channel solution. Real-Time Payment Platform (RPP) is a newly created team and I was assigned to develop the framework of this team and also a solutions. Main responsibility for me is to plan the team's KPI, layout the project objective, ROI projection to EPF, cost analysis, and also qualitative and quantitative benefits of this solutions. EPF would like to shift its traditional payment solution into Real-Time payment solution by on-boarding the DuitNow apps, an initiative from Bank Negara Malaysia (BNM).",
    "workBullet": [
      {
        "bullet": "Plan and develop Payment Framework and also team's capacity."
      },
      {
        "bullet": "Fully responsible to on-board DuitNow solution by engaging with PayNet as a stakeholder by gathering requirement, compliance guideline, and more."
      },
      {
        "bullet": "Transparent vendor management using ARIBA by inviting potential solution provider and fully manage the whole procurement process from RFI, RFP, Evaluation, RFQ, and Project Kick-Off."
      },
      {
        "bullet": "Key-person to present the strategic plan, project overview/progress, business/technical requirement, and more to CXO's (Top Management) and get their endorsement for each step."
      },
      {
        "bullet": "Involvement as senior analyst in Government-EPF Withdrawal schenme for Covid-19 Initiative which is iLestari, iSinar, and iCitra."
      }
    ],
    "workMethodologies": "Waterfall Methodologies",
    "workResponsibilities": "90% Management & 10% Technical",
    "workTechnology": ["Vendor Management", "Project Management (ISO Standard)", "AS400/Mainframe", "Presentation/Slides skills", "Enterprise Service Bus (ESB)", "Kubernetes", "RedHat Openshift 6+", "Negotiation Skills", "Politics skill"]
  },
  {
    "workPostition": "Senior Executive",
    "workType": "Permanent",
    "workTeam": "Application Solution Unit",
    "workCompany": "Securities Commission Malaysia",
    "workCompanyLogo": "https://upload.wikimedia.org/wikipedia/en/thumb/0/0c/Securities_Commission_Malaysia.svg/440px-Securities_Commission_Malaysia.svg.png",
    "workDuration": "Dec 2016 - Apr 2020",
    "workDescription" : "My very first job after graduation! As part of the Application Solution Unit, I was first exposed to maintain and enhance existing application according to the business or technological needs. As time goes by, my responsibilities increase with Digital Transformation agenda. A lot of new technologies was introduced to the team and organization such as Cloud technology, JavaScript framework (ReactJS/Angular), and more. This help our unit to improve a lot of web apps (300+ apps) from static sites into more responsive and dynamic web apps. This further enhance our stakeholder experience when using the apps.",
    "workBullet": [
      {
        "bullet": "Fully responsible on full-stack development of internal and external web applications for organizations."
      },
      {
        "bullet": "Work closely with team members, improving the business process, technological suitability, workflow, and also scalable."
      },
      {
        "bullet": "Work closely with other units in designing software architecture, configuring web server, troubleshooting databases and more to ensure the applications run smoothly."
      },
      {
        "bullet": "Continious business support on internal and external web apps."
      },
      {
        "bullet": "Continious effort in ensuring web apps are well maintained, updated, and free from malicious activities."
      }
    ],
    "workMethodologies": "Waterfall Methodologies (Main) | Agile Methodologies (Conditional)",
    "workResponsibilities": "60% Management & 40% Technical",
    "workTechnology": [".NET Framework", "ASP.NET", "C#", ".NET Core 2+", "VB.NET", "Microsoft SQL", "IIS Server", "Angular 3+", "Selenium Automation", "HangFire", "Capital Market & Investment"]
  },
  {
    "workPostition": "Intern",
    "workType": "Contract",
    "workTeam": "SKG09 - Traning & Assessment",
    "workCompany": "PETRONAS Carigali Sdn Bhd",
    "workCompanyLogo": "https://upload.wikimedia.org/wikipedia/en/thumb/b/be/Petronas_2013_logo.svg/1200px-Petronas_2013_logo.svg.png",
    "workDuration": "Jan 2015 - Aug 2015",
    "workDescription" : "As an intern, I was responsible to develop a simple Training Record web application to record PETRONAS Engineer assessment for promotion. The traditional method was using PPT slides and using Excel. Successfully transformed the traditional method into web apps using PHP Laravel and WampServer.",
    "workBullet": [
      {
        "bullet": "Responsible to develop, deliver, and provide training for the produced web apps to maintain PETRONAS Engineer training record."
      },
      {
        "bullet": "Assist supervisor to setup daily assessment for PETRONAS Engineer."
      },
      {
        "bullet": "Assist colleague on small day-to-day administrative tasks such as preparing slides, conduct a progress meetings, and so on."
      },
      {
        "bullet": "Participate and share developed projects with other intern from cross unit/department/subsidiary."
      },
      {
        "bullet": "Business support for the developed web apps in case of software bugs, enhancement, or a problem."
      }
    ],
    "workMethodologies": "Waterfall Methodologies (Main)",
    "workResponsibilities": "50% Management & 50% Technical",
    "workTechnology": ["PHP Laravel", "Bootstrap 2", "Wampserver", "Presentation/Slides skill", "Microsoft Excel"]
  }
]




